Revit 2027 API
PartMakerMethodToDivideVolumes.GetOffsetForIntersectingReference Method
 Gets offset for the intersecting reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetOffsetForIntersectingReference(
	ElementId intersectingReference
)
Public Function GetOffsetForIntersectingReference (
	intersectingReference As ElementId
) As Double
public:
double GetOffsetForIntersectingReference(
	ElementId^ intersectingReference
)
member GetOffsetForIntersectingReference :
        intersectingReference : ElementId -> float
Parameters
intersectingReference ElementId
 The intersecting reference to obtain offset value from.
Return Value
Double
 The offset for the intersecting reference
Exceptions
Exception | Condition
ArgumentException |  PartMaker does not use the specified intersecting reference.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace